const Discord = require('discord.js');

//run이라는 메소드(function)을 export(수출)
exports.run = (client, msg, args) => {
		if(msg.content=="뭐먹지")
		{
   var food;
   food=new Array("햄버거","피자","삼겹살","닭갈비","돈까스","초밥","회덮밥","짜장면","짬뽕","탕수육","굶어","재획","민트초코","장어구이","순대국밥","부대찌개","보쌈","갈비탕","꼬리곰탕","삼계탕","칼국수","쌀국수뚝배기","한솥","편의점도시락","봉구스밥버거","냉면","A+등급한우","볶음밥","오므라이스","떡만두국","순두부찌개","된장찌개","스파게티","함박스테이크","마라탕","탄탄면","규카츠","규동","치킨","닭볶음탕","라면","라볶이","전복죽","지코바치밥","전주비빔밥","족발","명륜진사갈비","니가? 먹어? 왜?");
    var t=Math.floor(Math.random()*(food.length));
 msg.channel.send("선택장애 "+msg.author.username+"님, 메뉴는 ["+food[t]+"]입니다 ^.^");
}
    };

exports.name='뭐먹지';